# Data Definition Language (DDL)

## **Introduction**

Data Definition Language (DDL) is a subset of SQL that is used to define and modify database structures. DDL is focused on the creation, alteration, and deletion of database structures like tables.

**Data Definition Language Keywords:**

- CREATE- Used to create new database objects
- ALTER- Used to modify database objects
- DROP- Deletes database objects

<span style="font-family: -apple-system, BlinkMacSystemFont, sans-serif; color: var(--vscode-foreground);">It is crucial that you have an understanding of both DDL and DML to properly administrate and interact with a database. Up to this point we have focused on data retrevial techniques like forming SELECT queries using JOINs, Aggregation, and subqueries, as well as DML operations like INSERT, UPDATE, and DELETE.&nbsp;</span>¬†  

## **Creating Tables**

We can use SQL to Create tables by defining their schema (or structure). This is the most foundational database skill. If your tables are not setup correctly then you will have ripple effects of those issues through your entire data pipeline. All the way from storage to representation. It's for this reason that we use ERDs and other planning tools to understand our table structure before we commit it to the database. For each field that we want to add to the table we need to include the name of the field, as well as the data type. There is other information that we could include, like whether the field is allowed to be null, or if it is a primary key. To become more familiar with SQL data types, please review the linked¬†[W3 School page on SQL Data types](https://www.w3schools.com/sql/sql_datatypes.asp#midcontentadcontainer).

For this notebook we will not be using tables that have already been created. Instead we will be making a set of database tables from scatch. Our database tables will store data related to college tours. This database will use four tables:

- ct\_tour\_guide (data about tour guides)
- ct\_tour (data bout tours)
- ct\_tour\_group (junction table linking visitors to tours)
- ct\_visitor (data about visitors that go on tours)

Please see the attached ERD on github for details on relationships and fields. You may notice text/entities that are different colors. This indicates that we will be adding them throughout the exercise, so if you do not see them during initial creation, don't worry!

  

The below cell selects all data from the ct\_tour\_guide table:

In [ ]:
--Display all information for tour guides
SELECT *
FROM ct_tour_guide
--See text cell below

The above cell should return an error stating that the table does not exists. That is because you will be creating it yourself! The below cell will create the ct\_tour\_guide table:

In [ ]:
--Create ct_tour_guide table
CREATE TABLE ct_tour_guide (
    tour_guide_id INT,
    guide_first_name VARCHAR(15),
    guide_last_name VARCHAR(30),
)

After the above command executes succesfully, you will be able to access the newly created ct\_tour\_guide table. Please not the structure of the above statement. We start with a CREATE TABLE clause where we note the name of the table. Afterwards, in parenthesis, we list each attribute/field name and it's data type. These are separated by commas. This is a very basic table creation statement.¬† We will be learning about how to make our CREATE statements more powerful later.

There are no records in this table. In the below cell we will create a transacation to add some records:

In [ ]:
--Transaction to add records into ct_tour_guide table
BEGIN TRANSACTION;
    BEGIN TRY
        INSERT INTO ct_tour_guide VALUES
        (1,'Kristi','Chapman'),
        (2,'Kelli','Cragin'),
        (3,'Jim','Riggs'),
        (4,'Denna','Clymer'),
        (5,'Chett','Daniel');
        COMMIT;
    END TRY
    BEGIN CATCH
        PRINT 'Error Message: ' + ERROR_MESSAGE();
        ROLLBACK;
    END CATCH

In [ ]:
--Check to see if records are added
SELECT *
FROM ct_tour_guide

That takes care of setting up data for one table. Now we will create the three remaining tables and add data to them. We can do this all in one script by setting up a transaction that includes both DDL for creating the tables and DML for adding to them. While we could do this all in one go, I am going to split this operation across three cells, one for each table. Sometimes these statements can be lengthy, to free up space in the notebook you can collapse/uncollapse a cell by clicking the arrow glyph at the bottom. The below cells have been collapsed. Please open and view them as you run each.

In [ ]:
--Create ct_tour table and add records
BEGIN TRANSACTION;
    BEGIN TRY
        --Create ct_tour table
        CREATE TABLE ct_tour (
            tour_id INT,
            tour_guide_id INT,
            tour_date DATETIME
        );
        --Insert records for tours
        INSERT INTO ct_tour VALUES
        (1,1,'2024-5-10'),
        (2,1,'2024-6-11'),
        (3,1,'2024-6-15'),
        (4,2,'2024-6-17'),
        (5,3,'2024-6-21'),
        (6,3,'2024-6-24'),
        (7,4,'2024-6-24'),
        (8,4,'2024-6-25'),
        (9,5,'2024-6-28');
        COMMIT;
    END TRY
    BEGIN CATCH
        PRINT 'Error Message: ' + ERROR_MESSAGE();
        ROLLBACK;
    END CATCH;

In [ ]:
--Create ct_visitor table and add records
BEGIN TRANSACTION;
    BEGIN TRY
        --Create ct_visitor table
        CREATE TABLE ct_visitor (
            visitor_id INT,
            visitor_first_name varchar(15),
            visitor_last_name varchar(30),
            phone_number varchar(11),
            email_address varchar(50)
        );
        --Insert records for visitors
        INSERT INTO ct_visitor VALUES
        (1, 'John', 'Doe', '1234567890', 'john.doe@example.com'),
        (2, 'Jane', 'Smith', '0987654321', 'jane.smith@example.com'),
        (3, 'Alice', 'Johnson', '1112223333', 'alice.johnson@example.com'),
        (4, 'Bob', 'Brown', '4445556666', 'bob.brown@example.com'),
        (5, 'Charlie', 'Davis', '7778889999', 'charlie.davis@example.com'),
        (6, 'Diana', 'Miller', '1010101010', 'diana.miller@example.com'),
        (7, 'Eve', 'Wilson', '2020202020', 'eve.wilson@example.com'),
        (8, 'Frank', 'Moore', '3030303030', 'frank.moore@example.com'),
        (9, 'Grace', 'Taylor', '4040404040', 'grace.taylor@example.com'),
        (10, 'Hank', 'Anderson', '5050505050', 'hank.anderson@example.com'),
        (11, 'Ivy', 'Thomas', '6060606060', 'ivy.thomas@example.com'),
        (12, 'Jack', 'Jackson', '7070707070', 'jack.jackson@example.com'),
        (13, 'Karen', 'White', '8080808080', 'karen.white@example.com'),
        (14, 'Leo', 'Harris', '9090909090', 'leo.harris@example.com'),
        (15, 'Mia', 'Martin', '1122334455', 'mia.martin@example.com'),
        (16, 'Nina', 'Thompson', '2233445566', 'nina.thompson@example.com'),
        (17, 'Oscar', 'Garcia', '3344556677', 'oscar.garcia@example.com'),
        (18, 'Paul', 'Martinez', '4455667788', 'paul.martinez@example.com'),
        (19, 'Quincy', 'Robinson', '5566778899', 'quincy.robinson@example.com'),
        (20, 'Rachel', 'Clark', '6677889900', 'rachel.clark@example.com'),
        (21, 'Sam', 'Rodriguez', '7788990011', 'sam.rodriguez@example.com'),
        (22, 'Tina', 'Lewis', '8899001122', 'tina.lewis@example.com'),
        (23, 'Uma', 'Lee', '9900112233', 'uma.lee@example.com'),
        (24, 'Victor', 'Walker', '1100110011', 'victor.walker@example.com'),
        (25, 'Wendy', 'Hall', '2200220022', 'wendy.hall@example.com'),
        (26, 'Xander', 'Allen', '3300330033', 'xander.allen@example.com'),
        (27, 'Yara', 'Young', '4400440044', 'yara.young@example.com'),
        (28, 'Zack', 'King', '5500550055', 'zack.king@example.com'),
        (29, 'Amy', 'Scott', '6600660066', 'amy.scott@example.com'),
        (30, 'Brian', 'Green', '7700770077', 'brian.green@example.com'),
        (31, 'Cathy', 'Adams', '8800880088', 'cathy.adams@example.com'),
        (32, 'David', 'Baker', '9900990099', 'david.baker@example.com'),
        (33, 'Ellen', 'Gonzalez', '1010101011', 'ellen.gonzalez@example.com'),
        (34, 'Fred', 'Nelson', '2020202022', 'fred.nelson@example.com'),
        (35, 'Gina', 'Carter', '3030303033', 'gina.carter@example.com'),
        (36, 'Harry', 'Mitchell', '4040404044', 'harry.mitchell@example.com'),
        (37, 'Isla', 'Perez', '5050505055', 'isla.perez@example.com'),
        (38, 'Jake', 'Roberts', '6060606066', 'jake.roberts@example.com'),
        (39, 'Kara', 'Turner', '7070707077', 'kara.turner@example.com'),
        (40, 'Liam', 'Phillips', '8080808088', 'liam.phillips@example.com'),
        (41, 'Megan', 'Campbell', '9090909099', 'megan.campbell@example.com'),
        (42, 'Nate', 'Parker', '1111111111', 'nate.parker@example.com'),
        (43, 'Olivia', 'Evans', '2222222222', 'olivia.evans@example.com'),
        (44, 'Pete', 'Edwards', '3333333333', 'pete.edwards@example.com'),
        (45, 'Quinn', 'Collins', '4444444444', 'quinn.collins@example.com');
        COMMIT;
    END TRY
    BEGIN CATCH
        PRINT 'Error Message: ' + ERROR_MESSAGE();
        ROLLBACK;
    END CATCH;

In [ ]:
--Create ct_tour_group table and add records
BEGIN TRANSACTION;
    BEGIN TRY
        --Create ct_tour_group table
        CREATE TABLE ct_tour_group (
            tour_group_id INT,
            tour_id INT,
            visitor_id INT
        );
        --Insert records for tour_groups
        INSERT INTO ct_tour_group VALUES
        (1, 1, 1),
        (2, 1, 2),
        (3, 1, 3),
        (4, 2, 4),
        (5, 2, 5),
        (6, 2, 6),
        (7, 3, 7),
        (8, 3, 8),
        (9, 3, 9),
        (10, 4, 10),
        (11, 4, 11),
        (12, 4, 12),
        (13, 5, 13),
        (14, 5, 14),
        (15, 5, 15),
        (16, 6, 16),
        (17, 6, 17),
        (18, 6, 18),
        (19, 7, 19),
        (20, 7, 20),
        (21, 7, 21),
        (22, 8, 22),
        (23, 8, 23),
        (24, 8, 24),
        (25, 9, 25),
        (26, 9, 26),
        (27, 9, 27),
        (28, 1, 28),
        (29, 1, 29),
        (30, 1, 30),
        (31, 2, 31),
        (32, 2, 32),
        (33, 2, 33),
        (34, 3, 34),
        (35, 3, 35),
        (36, 3, 36),
        (37, 4, 37),
        (38, 4, 38),
        (39, 4, 39),
        (40, 5, 40),
        (41, 5, 41),
        (42, 5, 42),
        (43, 6, 43),
        (44, 6, 44),
        (45, 6, 45),
        (46, 1, 5),
        (47, 2, 5),
        (48, 3, 5),
        (49, 4, 10),
        (50, 5, 10),
        (51, 6, 10),
        (52, 7, 20),
        (53, 8, 20),
        (54, 9, 20),
        (55, 1, 25),
        (56, 2, 25),
        (57, 3, 25);

        COMMIT;
    END TRY
    BEGIN CATCH
        PRINT 'Error Message: ' + ERROR_MESSAGE();
        ROLLBACK;
    END CATCH;

Now that we have sucessfully added all of our data to our databases, let's run a quick query to verify that everything is working properly. The below query just selects all data from each table. All tables are joined.

In [ ]:
--View all data for the 57 tour groups in the data set
SELECT *
FROM ct_tour_guide as tg
JOIN ct_tour as t ON tg.tour_guide_id = t.tour_guide_id
JOIN ct_tour_group as tgr ON t.tour_id = tgr.tour_id 
JOIN ct_visitor as v ON tgr.visitor_id = v.visitor_id

Based on the above result we can conclude that our transactions were succesful. We will learn more about CREATE statements in a future lesson.

‚úèÔ∏è¬†¬†¬†¬†¬†**Practice**

Administrators have decided that we must keep track of the department for each of the tour guides. The first step to this is adding a table to keep track of which departments there are on campus. In the below code cell, please construct a transaction to create a deparment table with the below structure, and insert the following data:

ct\_department structure:

- dep\_id INT
- dep\_name varchar(20)

Data:
|dep_id|dep_name|
|---|---|
|1|Communication|
|2|Engineering|
|3|Computer Science|
|4|Health Sciences|
|5|Agriculture|

In [ ]:
--Your code here

## **Altering Database Objects**

ALTER commands give us tools to update table structures after tables have been created. While there are many things you can do with ALTER ([You can learn about them here](https://www.techonthenet.com/sql_server/tables/alter_table.php)) we are going to focus on adding columns and modifying column data types.

To add a colunmn to a table, we can use the ADD keyword. In the below example we will add the dep\_id to ct\_tour\_guide to identify which department a tour guide belongs to.

In [ ]:
--Add department id column to tour guide table
ALTER TABLE ct_tour_guide
ADD dep_id INT

We use the same syntax to add a column to a table during an ALTER statement as we do when creating a table. The attribute name followed by the data type. The below cell will show all records in the ct\_tour\_guide so that we can verify that the column was added succesfully.

In [ ]:
SELECT * FROM ct_tour_guide

We can see that the column that we added is null, so we will need to use an UPDATE script to add values to the table. We will put this in a transaction in case there is an error:

In [ ]:
BEGIN TRANSACTION;
    BEGIN TRY
        UPDATE ct_tour_guide SET dep_id = 5 WHERE tour_guide_id = 1;
        UPDATE ct_tour_guide SET dep_id = 4 WHERE tour_guide_id = 3;
        UPDATE ct_tour_guide SET dep_id = 3 WHERE tour_guide_id = 4;
        UPDATE ct_tour_guide SET dep_id = 2 WHERE tour_guide_id = 5;
        UPDATE ct_tour_guide SET dep_id = 1 WHERE tour_guide_id = 2;
        COMMIT;
    END TRY
    BEGIN CATCH
        PRINT 'Error Message: ' + ERROR_MESSAGE();
        ROLLBACK;
    END CATCH

In [ ]:
--Check to see that values were updated properly
SELECT * FROM ct_tour_guide

When updating data, it is typically best to use an update statement for ecah individual change to avoid errors or accidentally overwritting data. We can see from the above result that the dep\_id is no longer null. It is always best to map out a database before you start creating tables so that you can do as few alterations as possible. Next we are going to update the data type of an existing field using an ALTER statement. We are doing this because the database produces errors when adding departments that have a name longer than 20 characters. Run the below cell to see what happens.

In [ ]:
INSERT INTO ct_department VALUES
(6,'Advanced Mathmatics And Sciences')

You should see an error message that describes trucating (shortening) the value so that it fits within the character limit and then the statement is terminated. To fix this we can ALTER the ct\_department table to accomodate a longer character length for department names.

In [ ]:
--Update dep_name column to hold up to 30 characters
ALTER TABLE ct_department
ALTER COLUMN dep_name VARCHAR(30)

Now that the ALTER operation is complete we are able to add departments with greater than 30 characters. Please note that we have to ALTER both the table and column in that order for these types of changes.

Run the below cell to verify that the change worked.

In [ ]:
INSERT INTO ct_department VALUES
(6,'Advanced Mathmatics And Sciences')

‚úèÔ∏è¬†¬†¬†¬†¬†**Practice**

It has been determined that allowing emails up to 50 characters long for visitors is a security risk. In the code cell below, update the email\_address field to only allow for emails up to 40 characters.

In [ ]:
--Your code here

## **Dropping Database Objects**

Sometimes it is necessary to delete an entire table from a database. Sometimes this is due to a schema error that it would be too much trouble to update, or because the table needs to be recreated. When there is a problem with a student's table (accidentally updated/deleted all records) I use DROP statements to delete them and then recreate them. DROP statements have very simple syntax, so they are very easy to write! However, just as with UPDATE and DELETE statements, you should read DROP statements carefully before running them to verify that everything is correct.

We do not want to drop any of the tables we have been using for this exercise, so instead we will create a simple temporary table that we can drop safely.

In [ ]:
--Create temporary table with single column
CREATE TABLE temp_table (
    column1 INT
)

Now that we have a table to play with, we will delete it using the below cell:

In [ ]:
DROP TABLE temp_table

To drop a table we simply write DROP TABLE followed by the name of the table. Sometimes things like constraints or other rules can make these statements more complex, but that is an adventure for a future lesson.

## **Exercises / Scenario**

You have been tasked with creating a database system to store information about music downloads. You must use a combination of CREATE, INSERT, UPDATE, ALTER, and SELECT statements to ensure the system is setup properly. Please see the provided ERD in github for information on how tables should be designed.

**Note: Your create and insert queries should ignore information in blue. This information will be added in a later step via altering.**

1\. Script a CREATE transaction to create the user, download, and song tables described in the ERD. **Do not include artist\_id**¬†**in your create statement.**

In [3]:
--Your code here
CREATE TABLE md_user (
    user_id INT PRIMARY KEY,
    first_name VARCHAR(30),
    last_name VARCHAR(30),
    email_address VARCHAR(40)
);

CREATE TABLE md_song (
    song_id INT PRIMARY KEY,
    song_title VARCHAR(50),
    genre VARCHAR(20)
);

CREATE TABLE md_download (
    download_id INT PRIMARY KEY,
    user_id INT,
    song_id INT,
    download_time DATETIME,
    FOREIGN KEY (user_id) REFERENCES md_user(user_id),
    FOREIGN KEY (song_id) REFERENCES md_song(song_id)
);

2\. Script an INSERT transaction that will insert the below data into the user, download, and song tables:

In [4]:
--Your code here (Providing pre-written data for your convenience. üòé)
-- Insert records into md_user table
INSERT INTO md_user
        (user_id, first_name, last_name, email_address)
VALUES
        (1, 'John', 'Doe', 'john.doe@example.com'),
        (2, 'Jane', 'Smith', 'jane.smith@example.com'),
        (3, 'Alice', 'Johnson', 'alice.johnson@example.com'),
        (4, 'Bob', 'Brown', 'bob.brown@example.com'),
        (5, 'Charlie', 'Davis', 'charlie.davis@example.com');

-- Insert records into md_song table
INSERT INTO md_song
        (song_id, song_title, genre)
VALUES
        (1, 'Song One', 'Pop'),
        (2, 'Song Two', 'Rock'),
        (3, 'Song Three', 'Jazz'),
        (4, 'Song Four', 'Classical'),
        (5, 'Song Five', 'Hip Hop');

-- Insert records into md_download table
INSERT INTO md_download
        (download_id, user_id, song_id, download_time)
VALUES
        (1, 1, 1, '2024-01-01 10:00:00'),
        (2, 1, 2, '2024-01-01 11:00:00'),
        (3, 2, 3, '2024-01-02 13:00:00'),
        (4, 2, 4, '2024-01-02 14:00:00'),
        (5, 3, 5, '2024-01-03 15:00:00'),
        (6, 4, 1, '2024-01-04 12:00:00'),
        (7, 4, 2, '2024-01-04 13:00:00'),
        (8, 4, 3, '2024-01-04 17:00:00'),
        (9, 5, 4, '2024-01-05 18:00:00'),
        (10, 5, 5, '2024-01-05 19:00:00');

3\. Script two transactions that accomplishes the following:

1. Transaction 1
1. Create an artist table
2. Insert the below data into the artist table
3. Alter the song table to include an attribute for artist\_id
3. Transaction 2
1. Update the song table to include the artist\_id that should be associated with each song (see below for help)

We are splitting this into two transactions to ensure that our ALTER statement is applied before we try to update records.

**Arist Data**
|artist_id|artist_first_name|artist_last_name|
|---|---|---|
|1|John|Lennon|
|2|Paul|McCartney|
|3|George|Harrison|
|4|Ringo|Starr|
|5|Elvis|Presley|

**Song data with artist**
|song_id|song_title|genre|artist_id|
|---|---|---|---|
|1|Song One|Pop|1|
|2|Song Two|Rock|2|
|3|Song Three|Jazz|3|
|4|Song Four|Classical|4|
|5|Song Five|Hip Hop|5|

In [8]:
--Your code here
-- Transaction 1:
BEGIN TRANSACTION;

CREATE TABLE md_artist
(
    artist_id INT PRIMARY KEY,
    artist_fname VARCHAR(30),
    artist_lname VARCHAR(30)
);

INSERT INTO md_artist
    (artist_id, artist_fname, artist_lname)
VALUES
    (1, 'John', 'Lennon'),
    (2, 'Paul', 'McCartney'),
    (3, 'George', 'Harrison'),
    (4, 'Ringo', 'Starr'),
    (5, 'Elvis', 'Presley');

ALTER TABLE md_song
ADD artist_id INT;

-- Transaction 2:
BEGIN TRANSACTION;

UPDATE md_song
SET artist_id = 1
WHERE song_id = 1;

UPDATE md_song
SET artist_id = 2
WHERE song_id = 2;

UPDATE md_song
SET artist_id = 3
WHERE song_id = 3;

UPDATE md_song
SET artist_id = 4
WHERE song_id = 4;

UPDATE md_song
SET artist_id = 5
WHERE song_id = 5;

COMMIT;

4\. Construct a query that will show the number of songs that each artist has in the database. Include the artists first and last name as well as the number of songs.

In [10]:
--Your code here
SELECT 
    a.artist_fname,
    a.artist_lname,
    COUNT(s.song_id) AS number_of_songs
FROM 
    md_artist a
LEFT JOIN 
    md_song s ON a.artist_id = s.artist_id
GROUP BY 
    a.artist_fname,
    a.artist_lname;

artist_first_name,artist_last_name,number_of_songs
George,Harrison,1
John,Lennon,1
Paul,McCartney,1
Elvis,Presley,1
Ringo,Starr,1

5\. Construct a query to show the amount of downloads that each user has completed. Include the user first and last name as well as the number of downloads.

In [11]:
--Your code here
SELECT 
    u.first_name,
    u.last_name,
    COUNT(d.download_id) AS number_of_downloads
FROM 
    md_user u
LEFT JOIN 
    md_download d ON u.user_id = d.user_id
GROUP BY 
    u.first_name,
    u.last_name;

first_name,last_name,number_of_downloads
Bob,Brown,3
Charlie,Davis,2
John,Doe,2
Alice,Johnson,1
Jane,Smith,2

6\. Script a transaction that will drop all four of the music download tables from your database.

In [12]:
--Your code here
BEGIN TRANSACTION;

DROP TABLE md_download;
DROP TABLE md_user;
DROP TABLE md_song;
DROP TABLE md_artist;

COMMIT;